__d(
  "WAWebMoment-tg",
  ["WAWeb-moment"],
  function (t, n, r, o, a, i, l) {
    var e = {
        0: "-\u0443\u043C",
        1: "-\u0443\u043C",
        2: "-\u044E\u043C",
        3: "-\u044E\u043C",
        4: "-\u0443\u043C",
        5: "-\u0443\u043C",
        6: "-\u0443\u043C",
        7: "-\u0443\u043C",
        8: "-\u0443\u043C",
        9: "-\u0443\u043C",
        10: "-\u0443\u043C",
        12: "-\u0443\u043C",
        13: "-\u0443\u043C",
        20: "-\u0443\u043C",
        30: "-\u044E\u043C",
        40: "-\u0443\u043C",
        50: "-\u0443\u043C",
        60: "-\u0443\u043C",
        70: "-\u0443\u043C",
        80: "-\u0443\u043C",
        90: "-\u0443\u043C",
        100: "-\u0443\u043C",
      },
      s = r("WAWeb-moment").defineLocale("tg", {
        months: {
          format:
            "\u044F\u043D\u0432\u0430\u0440\u0438_\u0444\u0435\u0432\u0440\u0430\u043B\u0438_\u043C\u0430\u0440\u0442\u0438_\u0430\u043F\u0440\u0435\u043B\u0438_\u043C\u0430\u0439\u0438_\u0438\u044E\u043D\u0438_\u0438\u044E\u043B\u0438_\u0430\u0432\u0433\u0443\u0441\u0442\u0438_\u0441\u0435\u043D\u0442\u044F\u0431\u0440\u0438_\u043E\u043A\u0442\u044F\u0431\u0440\u0438_\u043D\u043E\u044F\u0431\u0440\u0438_\u0434\u0435\u043A\u0430\u0431\u0440\u0438".split(
              "_",
            ),
          standalone:
            "\u044F\u043D\u0432\u0430\u0440_\u0444\u0435\u0432\u0440\u0430\u043B_\u043C\u0430\u0440\u0442_\u0430\u043F\u0440\u0435\u043B_\u043C\u0430\u0439_\u0438\u044E\u043D_\u0438\u044E\u043B_\u0430\u0432\u0433\u0443\u0441\u0442_\u0441\u0435\u043D\u0442\u044F\u0431\u0440_\u043E\u043A\u0442\u044F\u0431\u0440_\u043D\u043E\u044F\u0431\u0440_\u0434\u0435\u043A\u0430\u0431\u0440".split(
              "_",
            ),
        },
        monthsShort:
          "\u044F\u043D\u0432_\u0444\u0435\u0432_\u043C\u0430\u0440_\u0430\u043F\u0440_\u043C\u0430\u0439_\u0438\u044E\u043D_\u0438\u044E\u043B_\u0430\u0432\u0433_\u0441\u0435\u043D_\u043E\u043A\u0442_\u043D\u043E\u044F_\u0434\u0435\u043A".split(
            "_",
          ),
        weekdays:
          "\u044F\u043A\u0448\u0430\u043D\u0431\u0435_\u0434\u0443\u0448\u0430\u043D\u0431\u0435_\u0441\u0435\u0448\u0430\u043D\u0431\u0435_\u0447\u043E\u0440\u0448\u0430\u043D\u0431\u0435_\u043F\u0430\u043D\u04B7\u0448\u0430\u043D\u0431\u0435_\u04B7\u0443\u043C\u044A\u0430_\u0448\u0430\u043D\u0431\u0435".split(
            "_",
          ),
        weekdaysShort:
          "\u044F\u0448\u0431_\u0434\u0448\u0431_\u0441\u0448\u0431_\u0447\u0448\u0431_\u043F\u0448\u0431_\u04B7\u0443\u043C_\u0448\u043D\u0431".split(
            "_",
          ),
        weekdaysMin:
          "\u044F\u0448_\u0434\u0448_\u0441\u0448_\u0447\u0448_\u043F\u0448_\u04B7\u043C_\u0448\u0431".split(
            "_",
          ),
        longDateFormat: {
          LT: "HH:mm",
          LTS: "HH:mm:ss",
          L: "DD.MM.YYYY",
          LL: "D MMMM YYYY",
          LLL: "D MMMM YYYY HH:mm",
          LLLL: "dddd, D MMMM YYYY HH:mm",
        },
        calendar: {
          sameDay:
            "[\u0418\u043C\u0440\u04EF\u0437 \u0441\u043E\u0430\u0442\u0438] LT",
          nextDay:
            "[\u0424\u0430\u0440\u0434\u043E \u0441\u043E\u0430\u0442\u0438] LT",
          lastDay:
            "[\u0414\u0438\u0440\u04EF\u0437 \u0441\u043E\u0430\u0442\u0438] LT",
          nextWeek:
            "dddd[\u0438] [\u04B3\u0430\u0444\u0442\u0430\u0438 \u043E\u044F\u043D\u0434\u0430 \u0441\u043E\u0430\u0442\u0438] LT",
          lastWeek:
            "dddd[\u0438] [\u04B3\u0430\u0444\u0442\u0430\u0438 \u0433\u0443\u0437\u0430\u0448\u0442\u0430 \u0441\u043E\u0430\u0442\u0438] LT",
          sameElse: "L",
        },
        relativeTime: {
          future: "\u0431\u0430\u044A\u0434\u0438 %s",
          past: "%s \u043F\u0435\u0448",
          s: "\u044F\u043A\u0447\u0430\u043D\u0434 \u0441\u043E\u043D\u0438\u044F",
          m: "\u044F\u043A \u0434\u0430\u049B\u0438\u049B\u0430",
          mm: "%d \u0434\u0430\u049B\u0438\u049B\u0430",
          h: "\u044F\u043A \u0441\u043E\u0430\u0442",
          hh: "%d \u0441\u043E\u0430\u0442",
          d: "\u044F\u043A \u0440\u04EF\u0437",
          dd: "%d \u0440\u04EF\u0437",
          M: "\u044F\u043A \u043C\u043E\u04B3",
          MM: "%d \u043C\u043E\u04B3",
          y: "\u044F\u043A \u0441\u043E\u043B",
          yy: "%d \u0441\u043E\u043B",
        },
        meridiemParse: /шаб|субҳ|рӯз|бегоҳ/,
        meridiemHour: function (t, n) {
          if ((t === 12 && (t = 0), n === "\u0448\u0430\u0431"))
            return t < 4 ? t : t + 12;
          if (n === "\u0441\u0443\u0431\u04B3") return t;
          if (n === "\u0440\u04EF\u0437") return t >= 11 ? t : t + 12;
          if (n === "\u0431\u0435\u0433\u043E\u04B3") return t + 12;
        },
        meridiem: function (t, n, r) {
          return t < 4
            ? "\u0448\u0430\u0431"
            : t < 11
              ? "\u0441\u0443\u0431\u04B3"
              : t < 16
                ? "\u0440\u04EF\u0437"
                : t < 19
                  ? "\u0431\u0435\u0433\u043E\u04B3"
                  : "\u0448\u0430\u0431";
        },
        dayOfMonthOrdinalParse: /\d{1,2}-(ум|юм)/,
        ordinal: function (n) {
          var t = n % 10,
            r = n >= 100 ? 100 : null;
          return n + (e[n] || e[t] || e[r]);
        },
        week: { dow: 1, doy: 7 },
      });
  },
  34,
);
