__d(
  "WAWebMoment-hi",
  ["WAWeb-moment"],
  function (t, n, r, o, a, i, l) {
    var e = {
        1: "\u0967",
        2: "\u0968",
        3: "\u0969",
        4: "\u096A",
        5: "\u096B",
        6: "\u096C",
        7: "\u096D",
        8: "\u096E",
        9: "\u096F",
        0: "\u0966",
      },
      s = {
        "\u0967": "1",
        "\u0968": "2",
        "\u0969": "3",
        "\u096A": "4",
        "\u096B": "5",
        "\u096C": "6",
        "\u096D": "7",
        "\u096E": "8",
        "\u096F": "9",
        "\u0966": "0",
      },
      u = [
        /^जन/i,
        /^फ़र|फर/i,
        /^मार्च/i,
        /^अप्रै/i,
        /^मई/i,
        /^जून/i,
        /^जुल/i,
        /^अग/i,
        /^सितं|सित/i,
        /^अक्टू/i,
        /^नव|नवं/i,
        /^दिसं|दिस/i,
      ],
      c = [
        /^जन/i,
        /^फ़र/i,
        /^मार्च/i,
        /^अप्रै/i,
        /^मई/i,
        /^जून/i,
        /^जुल/i,
        /^अग/i,
        /^सित/i,
        /^अक्टू/i,
        /^नव/i,
        /^दिस/i,
      ],
      d = r("WAWeb-moment").defineLocale("hi", {
        months: {
          format:
            "\u091C\u0928\u0935\u0930\u0940_\u092B\u093C\u0930\u0935\u0930\u0940_\u092E\u093E\u0930\u094D\u091A_\u0905\u092A\u094D\u0930\u0948\u0932_\u092E\u0908_\u091C\u0942\u0928_\u091C\u0941\u0932\u093E\u0908_\u0905\u0917\u0938\u094D\u0924_\u0938\u093F\u0924\u092E\u094D\u092C\u0930_\u0905\u0915\u094D\u091F\u0942\u092C\u0930_\u0928\u0935\u092E\u094D\u092C\u0930_\u0926\u093F\u0938\u092E\u094D\u092C\u0930".split(
              "_",
            ),
          standalone:
            "\u091C\u0928\u0935\u0930\u0940_\u092B\u0930\u0935\u0930\u0940_\u092E\u093E\u0930\u094D\u091A_\u0905\u092A\u094D\u0930\u0948\u0932_\u092E\u0908_\u091C\u0942\u0928_\u091C\u0941\u0932\u093E\u0908_\u0905\u0917\u0938\u094D\u0924_\u0938\u093F\u0924\u0902\u092C\u0930_\u0905\u0915\u094D\u091F\u0942\u092C\u0930_\u0928\u0935\u0902\u092C\u0930_\u0926\u093F\u0938\u0902\u092C\u0930".split(
              "_",
            ),
        },
        monthsShort:
          "\u091C\u0928._\u092B\u093C\u0930._\u092E\u093E\u0930\u094D\u091A_\u0905\u092A\u094D\u0930\u0948._\u092E\u0908_\u091C\u0942\u0928_\u091C\u0941\u0932._\u0905\u0917._\u0938\u093F\u0924._\u0905\u0915\u094D\u091F\u0942._\u0928\u0935._\u0926\u093F\u0938.".split(
            "_",
          ),
        weekdays:
          "\u0930\u0935\u093F\u0935\u093E\u0930_\u0938\u094B\u092E\u0935\u093E\u0930_\u092E\u0902\u0917\u0932\u0935\u093E\u0930_\u092C\u0941\u0927\u0935\u093E\u0930_\u0917\u0941\u0930\u0942\u0935\u093E\u0930_\u0936\u0941\u0915\u094D\u0930\u0935\u093E\u0930_\u0936\u0928\u093F\u0935\u093E\u0930".split(
            "_",
          ),
        weekdaysShort:
          "\u0930\u0935\u093F_\u0938\u094B\u092E_\u092E\u0902\u0917\u0932_\u092C\u0941\u0927_\u0917\u0941\u0930\u0942_\u0936\u0941\u0915\u094D\u0930_\u0936\u0928\u093F".split(
            "_",
          ),
        weekdaysMin:
          "\u0930_\u0938\u094B_\u092E\u0902_\u092C\u0941_\u0917\u0941_\u0936\u0941_\u0936".split(
            "_",
          ),
        longDateFormat: {
          LT: "A h:mm \u092C\u091C\u0947",
          LTS: "A h:mm:ss \u092C\u091C\u0947",
          L: "DD/MM/YYYY",
          LL: "D MMMM YYYY",
          LLL: "D MMMM YYYY, A h:mm \u092C\u091C\u0947",
          LLLL: "dddd, D MMMM YYYY, A h:mm \u092C\u091C\u0947",
        },
        monthsParse: u,
        longMonthsParse: u,
        shortMonthsParse: c,
        monthsRegex:
          /^(जनवरी|जन\.?|फ़रवरी|फरवरी|फ़र\.?|मार्च?|अप्रैल|अप्रै\.?|मई?|जून?|जुलाई|जुल\.?|अगस्त|अग\.?|सितम्बर|सितंबर|सित\.?|अक्टूबर|अक्टू\.?|नवम्बर|नवंबर|नव\.?|दिसम्बर|दिसंबर|दिस\.?)/i,
        monthsShortRegex:
          /^(जनवरी|जन\.?|फ़रवरी|फरवरी|फ़र\.?|मार्च?|अप्रैल|अप्रै\.?|मई?|जून?|जुलाई|जुल\.?|अगस्त|अग\.?|सितम्बर|सितंबर|सित\.?|अक्टूबर|अक्टू\.?|नवम्बर|नवंबर|नव\.?|दिसम्बर|दिसंबर|दिस\.?)/i,
        monthsStrictRegex:
          /^(जनवरी?|फ़रवरी|फरवरी?|मार्च?|अप्रैल?|मई?|जून?|जुलाई?|अगस्त?|सितम्बर|सितंबर|सित?\.?|अक्टूबर|अक्टू\.?|नवम्बर|नवंबर?|दिसम्बर|दिसंबर?)/i,
        monthsShortStrictRegex:
          /^(जन\.?|फ़र\.?|मार्च?|अप्रै\.?|मई?|जून?|जुल\.?|अग\.?|सित\.?|अक्टू\.?|नव\.?|दिस\.?)/i,
        calendar: {
          sameDay: "[\u0906\u091C] LT",
          nextDay: "[\u0915\u0932] LT",
          nextWeek: "dddd, LT",
          lastDay: "[\u0915\u0932] LT",
          lastWeek: "[\u092A\u093F\u091B\u0932\u0947] dddd, LT",
          sameElse: "L",
        },
        relativeTime: {
          future: "%s \u092E\u0947\u0902",
          past: "%s \u092A\u0939\u0932\u0947",
          s: "\u0915\u0941\u091B \u0939\u0940 \u0915\u094D\u0937\u0923",
          ss: "%d \u0938\u0947\u0915\u0902\u0921",
          m: "\u090F\u0915 \u092E\u093F\u0928\u091F",
          mm: "%d \u092E\u093F\u0928\u091F",
          h: "\u090F\u0915 \u0918\u0902\u091F\u093E",
          hh: "%d \u0918\u0902\u091F\u0947",
          d: "\u090F\u0915 \u0926\u093F\u0928",
          dd: "%d \u0926\u093F\u0928",
          M: "\u090F\u0915 \u092E\u0939\u0940\u0928\u0947",
          MM: "%d \u092E\u0939\u0940\u0928\u0947",
          y: "\u090F\u0915 \u0935\u0930\u094D\u0937",
          yy: "%d \u0935\u0930\u094D\u0937",
        },
        preparse: function (t) {
          return t.replace(/[१२३४५६७८९०]/g, function (e) {
            return s[e];
          });
        },
        postformat: function (n) {
          return n.replace(/\d/g, function (t) {
            return e[t];
          });
        },
        meridiemParse: /रात|सुबह|दोपहर|शाम/,
        meridiemHour: function (t, n) {
          if ((t === 12 && (t = 0), n === "\u0930\u093E\u0924"))
            return t < 4 ? t : t + 12;
          if (n === "\u0938\u0941\u092C\u0939") return t;
          if (n === "\u0926\u094B\u092A\u0939\u0930")
            return t >= 10 ? t : t + 12;
          if (n === "\u0936\u093E\u092E") return t + 12;
        },
        meridiem: function (t, n, r) {
          return t < 4
            ? "\u0930\u093E\u0924"
            : t < 10
              ? "\u0938\u0941\u092C\u0939"
              : t < 17
                ? "\u0926\u094B\u092A\u0939\u0930"
                : t < 20
                  ? "\u0936\u093E\u092E"
                  : "\u0930\u093E\u0924";
        },
        week: { dow: 0, doy: 6 },
      });
  },
  34,
);
